Revit 2024 API
MessageBoxData Class
 An object that represents a simple message box that prompts the user for some action.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class MessageBoxData : DialogBoxData
Visual Basic
Public Class MessageBoxData _
	Inherits DialogBoxData
Visual C++
public ref class MessageBoxData : public DialogBoxData
Remarks
 When the application receives this object, a simple message box is displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.Events.DialogBoxData
 Autodesk.Revit.UI.Events.MessageBoxData
See Also
MessageBoxData Members
Autodesk.Revit.UI.Events Namespace